src/cf/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Покупка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СтоимостьТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументЗакрытияМесяца</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/Покупка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Покупка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗатратыНаАкции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/МодульЗакрытиеМесяца/Ext/Module.bsl
Процедура УстановитьАктуальностьРасчетаСебестоимостиПоПроводимомуДокументу(ДатаДокумента) Экспорт
	_Запрос = Новый Запрос;
	_Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ) >= &НачалоМесяцаТекущаяДата
		|	И ЗакрытиеМесяца.Проведен";

	_Запрос.УстановитьПараметр("НачалоМесяцаТекущаяДата", НачалоМесяца(ДатаДокумента));

	Выборка = _Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;

	_Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ)) КАК Дата
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	ЗакрытиеМесяца.Проведен
		|
		|ИМЕЮЩИЕ
		|	НЕ МАКСИМУМ(НАЧАЛОПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ)) ЕСТЬ NULL";

	Выборка = _Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Константы.КрайняяДатаЗакрытогоПериода.Установить(Выборка.Дата);
	Иначе
		Константы.КрайняяДатаЗакрытогоПериода.Установить('00010101');
	КонецЕсли;
КонецПроцедуры

Процедура ЗакрытьМесяц(ДатаЗакрытия) Экспорт
	СтатусЗакрытияПредыдущегоМесяца = ПолучитьСтатусЗакрытияМесяца(ДобавитьМесяц(ДатаЗакрытия, -1));
	Если НЕ СтатусЗакрытияПредыдущегоМесяца Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Невозможно закрыть текущий месяц, так как есть незакрытые предыдущие месяцы";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	_Запрос = Новый Запрос;
	_Запрос.Текст =
		"ВЫБРАТЬ
		|	ПартииТоваровОбороты.Партия.Дата КАК ДатаПартии,
		|	ПартииТоваровОбороты.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ПокупкаТовары.Цена) КАК Цена
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПартииТоваровОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Покупка.Товары КАК ПокупкаТовары
		|		ПО ПартииТоваровОбороты.Партия = ПокупкаТовары.Ссылка
		|			И ПартииТоваровОбороты.Номенклатура = ПокупкаТовары.Номенклатура
		|ГДЕ
		|	ПартииТоваровОбороты.КоличествоПриход > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровОбороты.Номенклатура,
		|	ПартииТоваровОбороты.Партия,
		|	ПартииТоваровОбороты.Партия.Дата";

	_Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаЗакрытия));
	_Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДатаЗакрытия));

	ВыборкаСебестоимость = _Запрос.Выполнить().Выбрать();

	_Запрос.Параметры.Очистить();
	_Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ) = &Дата
		|	И НЕ ЗакрытиеМесяца.ПометкаУдаления";

	_Запрос.УстановитьПараметр("Дата", НачалоМесяца(ДатаЗакрытия));

	Выборка = _Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.ЗакрытиеМесяца.СоздатьДокумент();
	КонецЕсли;

	ДокументОбъект.Дата = ДатаЗакрытия;

	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ДокументСсылка = ДокументОбъект.Ссылка;

	НаборЗаписей = РегистрыСведений.СтоимостьТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументЗакрытияМесяца.Установить(ДокументСсылка);

	Пока ВыборкаСебестоимость.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.ДокументЗакрытияМесяца = ДокументСсылка;
		Запись.Номенклатура = ВыборкаСебестоимость.Номенклатура;
		Запись.Дата = ВыборкаСебестоимость.ДатаПартии;
		Запись.Себестоимость = ВыборкаСебестоимость.Цена;
	КонецЦикла;

	НаборЗаписей.Записать();

	Константы.КрайняяДатаЗакрытогоПериода.Установить(ДатаЗакрытия);
КонецПроцедуры

Функция ПолучитьСтатусЗакрытияМесяца(Дата) Экспорт
	_Запрос = Новый Запрос;
	_Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МИНИМУМ(ПартииТоваровОбороты.Период), ДАТАВРЕМЯ(1, 1, 1)) КАК Период
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Обороты(, , Месяц, ) КАК ПартииТоваровОбороты
		|ГДЕ
		|	ПартииТоваровОбороты.КоличествоПриход > 0";

	Выборка = _Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Если Дата < Выборка.Период Тогда
		Возврат Истина;
	КонецЕсли;

	_Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ) = &Дата
		|	И ЗакрытиеМесяца.Проведен";

	_Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата));

	Выборка = _Запрос.Выполнить().Выбрать();

	Возврат Выборка.Следующий();
КонецФункции
